public_html/before 2019/2014-08-10-how-to-select-language.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-02 一 19:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="renshuo" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga56ec04">文件操作</a></li>
<li><a href="#orgff8ea98">字符串定义和操作</a></li>
<li><a href="#org2c782b4">统计功能，或者可代替的简单做法</a></li>
<li><a href="#orge8e85d9">运行简单方便，速度快</a></li>
<li><a href="#org18ee8c1">支持正则表达式</a></li>
<li><a href="#orgfb803b5">shell+awk+sed 等</a></li>
<li><a href="#org45365c1">python</a></li>
<li><a href="#org6cf1956">perl</a></li>
<li><a href="#orge22be1e">php 不清楚如何在没有WebServer的情况下运行，而且linux默认没有这个</a></li>
<li><a href="#org509d66b">ruby</a></li>
<li><a href="#orgad0228e">VBscript等office自带的脚本语言</a></li>
<li><a href="#org9c78eb4">你熟悉的任何语言</a></li>
<li><a href="#orgb98ab51">运行方便简单，速度快</a></li>
<li><a href="#orgfb45fa0">可以方便调用命令行或者其他程序（用于调用外部工具）</a></li>
<li><a href="#org472db74">可扩展</a></li>
<li><a href="#org50d4c94">代码简单</a></li>
<li><a href="#orgd60d5ab">shell</a></li>
<li><a href="#org3d20611">xml(ant, maven&#x2026;)</a></li>
<li><a href="#org69a2e38">python</a></li>
<li><a href="#org747fa58">groovy 因为gradle而入选</a></li>
<li><a href="#org75dbbd2">ruby 因为buildr而入选</a></li>
<li><a href="#orgf871f0f">你用什么写代码，就用他们管理他们自己</a></li>
<li><a href="#org078270d">运行方便简单，速度快</a></li>
<li><a href="#orge1fc879">可以方便调用命令行或者其他程序</a></li>
<li><a href="#orgd575ee4">代码简单</a></li>
<li><a href="#org03fc924">shell</a></li>
<li><a href="#org2c20e87">python</a></li>
<li><a href="#org9321bb2">groovy</a></li>
<li><a href="#orgdd07d77">ruby</a></li>
</ul>
</div>
</div>
<p>
## 在不同的场景下需要使用不同的语言
	Unix编程艺术中的 无根的根中的一段：
	   无名师与万行码 
	   无名师曾对来访的程序员说：“Unix传统上认为，一行 shell脚本胜过万行C程序." 
	   这个程序员自以为对C极其精通，说：“这不可能。Unix内核正是用C实现的。” 
	   无名师回道：“确实如此。不过，Unix传统上认为，一行shell脚本胜过万行C程序." 
	   程序员颇为沮丧：“但是在C中我们可领会到尊者Ritchie的智慧。我们与操作系统和机器合而为一，可以获取无与伦比的性能。“ 
	   无名师回道：“诚如你言。不过，Unix传统上认为，一行shell脚本胜过万行C程序。” 
	   程序员冷笑着想悲愤离去。无名师向学生Nabi颌首示意，Nubi在黑板上写下一行shell脚本，问道：“尊敬的程序员，看看这行管道。用纯C实现，是 不是要一万行C代码？“ 
	   程序员沉吟念诵。最终他承认如此。 
	   “你需要多长时间来实现和调试那个C程序?"Nubi问道。 
	   “很长”，来访程序员承认。“但傻子才会干这个而不去完成更有价值的任务。” 
	   “那么谁更了解Unix传统？”无名师问道。“是写一万行代码的，还是看到任务的无谓而不去编码的？” 
	   听到此，程序员眼中一亮。
</p>


<p>
## 文本处理场景
</p>

<p>
用来处理文本，或者文本文件内容，比如给多个文件增加注释。
</p>

<div id="outline-container-orga56ec04" class="outline-2">
<h2 id="orga56ec04">文件操作</h2>
</div>
<div id="outline-container-orgff8ea98" class="outline-2">
<h2 id="orgff8ea98">字符串定义和操作</h2>
</div>
<div id="outline-container-org2c782b4" class="outline-2">
<h2 id="org2c782b4">统计功能，或者可代替的简单做法</h2>
</div>
<div id="outline-container-orge8e85d9" class="outline-2">
<h2 id="orge8e85d9">运行简单方便，速度快</h2>
</div>
<div id="outline-container-org18ee8c1" class="outline-2">
<h2 id="org18ee8c1">支持正则表达式</h2>
<div class="outline-text-2" id="text-org18ee8c1">
<p>
候选语言：
</p>
</div>
</div>

<div id="outline-container-orgfb803b5" class="outline-2">
<h2 id="orgfb803b5">shell+awk+sed 等</h2>
</div>
<div id="outline-container-org45365c1" class="outline-2">
<h2 id="org45365c1">python</h2>
</div>
<div id="outline-container-org6cf1956" class="outline-2">
<h2 id="org6cf1956">perl</h2>
</div>
<div id="outline-container-orge22be1e" class="outline-2">
<h2 id="orge22be1e">php 不清楚如何在没有WebServer的情况下运行，而且linux默认没有这个</h2>
</div>
<div id="outline-container-org509d66b" class="outline-2">
<h2 id="org509d66b">ruby</h2>
</div>
<div id="outline-container-orgad0228e" class="outline-2">
<h2 id="orgad0228e">VBscript等office自带的脚本语言</h2>
</div>
<div id="outline-container-org9c78eb4" class="outline-2">
<h2 id="org9c78eb4">你熟悉的任何语言</h2>
<div class="outline-text-2" id="text-org9c78eb4">
<p>
## 代码，工程管理场景
</p>

<p>
用来管理各种工程的更新，编译，打包等
</p>
</div>
</div>

<div id="outline-container-orgb98ab51" class="outline-2">
<h2 id="orgb98ab51">运行方便简单，速度快</h2>
</div>
<div id="outline-container-orgfb45fa0" class="outline-2">
<h2 id="orgfb45fa0">可以方便调用命令行或者其他程序（用于调用外部工具）</h2>
</div>
<div id="outline-container-org472db74" class="outline-2">
<h2 id="org472db74">可扩展</h2>
</div>
<div id="outline-container-org50d4c94" class="outline-2">
<h2 id="org50d4c94">代码简单</h2>
<div class="outline-text-2" id="text-org50d4c94">
<p>
候选语言：
</p>
</div>
</div>

<div id="outline-container-orgd60d5ab" class="outline-2">
<h2 id="orgd60d5ab">shell</h2>
</div>
<div id="outline-container-org3d20611" class="outline-2">
<h2 id="org3d20611">xml(ant, maven&#x2026;)</h2>
</div>
<div id="outline-container-org69a2e38" class="outline-2">
<h2 id="org69a2e38">python</h2>
</div>
<div id="outline-container-org747fa58" class="outline-2">
<h2 id="org747fa58">groovy 因为gradle而入选</h2>
</div>
<div id="outline-container-org75dbbd2" class="outline-2">
<h2 id="org75dbbd2">ruby 因为buildr而入选</h2>
</div>
<div id="outline-container-orgf871f0f" class="outline-2">
<h2 id="orgf871f0f">你用什么写代码，就用他们管理他们自己</h2>
<div class="outline-text-2" id="text-orgf871f0f">
<p>
## 自动化
</p>

<p>
用来自动化测试，自动化工作等
</p>
</div>
</div>

<div id="outline-container-org078270d" class="outline-2">
<h2 id="org078270d">运行方便简单，速度快</h2>
</div>
<div id="outline-container-orge1fc879" class="outline-2">
<h2 id="orge1fc879">可以方便调用命令行或者其他程序</h2>
</div>
<div id="outline-container-orgd575ee4" class="outline-2">
<h2 id="orgd575ee4">代码简单</h2>
<div class="outline-text-2" id="text-orgd575ee4">
<p>
候选语言：
</p>
</div>
</div>

<div id="outline-container-org03fc924" class="outline-2">
<h2 id="org03fc924">shell</h2>
</div>
<div id="outline-container-org2c20e87" class="outline-2">
<h2 id="org2c20e87">python</h2>
</div>
<div id="outline-container-org9321bb2" class="outline-2">
<h2 id="org9321bb2">groovy</h2>
</div>
<div id="outline-container-orgdd07d77" class="outline-2">
<h2 id="orgdd07d77">ruby</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: renshuo</p>
<p class="date">Created: 2019-09-02 一 19:54</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
